Waterschmidt/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    top
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          60;
        startFace       13260;
    }
    bottom
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          60;
        startFace       13320;
    }
    walls
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          360;
        startFace       13380;
    }
    frontAndBack
    {
        type            symmetry;
        inGroups        List<word> 1(symmetry);
        nFaces          5400;
        startFace       13740;
    }
)

// ************************************************************************* //
